abhishekaudupa/STM32G491RE-drivers/src/main.c
#include <stddef.h>
#include "stm32g491xx.h"
#include "startup.h"
#include "nucleoG491RE.h"
#include "flash.h"
#include "clock.h"
#include "lpuart.h"
#include "print.h"
#include "delay.h"
#include "power.h"
#include "deviceid.h"

void main(void) {
    enable_user_led();
    enable_systick();

    init_lpuart1(115200);
    my_printf("lpuart initialized. sysclk is %d MHz, ahbclk is %d MHz, pclk1 = %d MHz and pclk2 = %d MHz\n", 
	    get_sysclk_speed() / 1000000, 
	    get_hclk_speed() / 1000000,
	    get_pclk1_speed() / 1000000,
	    get_pclk2_speed() / 1000000);
    
    set_sysclk_pll(PLL_HSE24_144);
    init_lpuart1(115200);
    my_printf("lpuart initialized. sysclk is %d MHz, ahbclk is %d MHz, pclk1 = %d MHz and pclk2 = %d MHz\n", 
	    get_sysclk_speed() / 1000000, 
	    get_hclk_speed() / 1000000,
	    get_pclk1_speed() / 1000000,
	    get_pclk2_speed() / 1000000);
    
    set_sysclk_pll(PLL_HSE24_16);
    init_lpuart1(115200);
    my_printf("lpuart initialized. sysclk is %d MHz, ahbclk is %d MHz, pclk1 = %d MHz and pclk2 = %d MHz\n", 
	    get_sysclk_speed() / 1000000, 
	    get_hclk_speed() / 1000000,
	    get_pclk1_speed() / 1000000,
	    get_pclk2_speed() / 1000000);

#ifdef LPUART1_POLL_MODE
    char buf[256];
    uint8_t ri = 0;
    uint8_t ti = 0;

    while(1) {
	if(rx_poll_lpuart1(buf + ri) != NULL) {
	    tx_single_lpuart1(buf + ti);
	    ri++;
	    ti++;
	}
    }
#endif
}
